src/cf/InformationRegisters/SharedUsers.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>SharedUsers</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>SequenceNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>UserName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>IBUserID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/SharedUsers/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Internal

// Returns a list of shared administrators
//
// Returns:
//   ValueList   - a list of UUIDs with presentations (usernames).
//
Function AdministratorsList() Export
	
	Query = New Query;
	Query.Text = 
		"SELECT
		|	SharedUsers.IBUserID
		|FROM
		|	InformationRegister.SharedUsers AS SharedUsers";
	Selection = Query.Execute().Select();
	AdministratorsList = New ValueList;
	While Selection.Next() Do
		IBUser = InfoBaseUsers.FindByUUID(
			Selection.IBUserID);
		If IBUser = Undefined Then
			Continue;
		EndIf;		
		UserRole_SSLyf = Undefined;
		For Each Role In IBUser.Roles Do
			UserRole_SSLyf = Role;
			Break;
		EndDo;
		If UserRole_SSLyf = Undefined Then
			Continue;
		EndIf;		
		If Not Users.IsFullUser(IBUser, True) Then
			Continue;
		EndIf;
		AdministratorsList.Add(Selection.IBUserID, IBUser.Name);
	EndDo;
	AdministratorsList.SortByPresentation();
	Return AdministratorsList;
	
EndFunction

// Returns a maximum sequence number of a shared infobase user.
//
// Returns:
//  Number
//
Function MaxSequenceNumber() Export
	
	QueryText = "SELECT
	               |	ISNULL(MAX(SharedUsers.SequenceNumber), 0) AS SequenceNumber
	               |FROM
	               |	InformationRegister.SharedUsers AS SharedUsers";
	Query = New Query(QueryText);
	Selection = Query.Execute().Select();
	If Selection.Next() Then
		Return Selection.SequenceNumber;
	Else
		Return 0;
	EndIf;
	
EndFunction

// Returns a sequence number of a shared infobase user
//
// Parameters:
//  Id - an infobase user UUID.
//
// Returns:
//  Number
//
Function IBUserSequenceNumber(Id) Export
	
	Query = New Query;
	Query.SetParameter("IBUserID", Id);
	Query.Text =
	"SELECT
	|	SharedUsers.SequenceNumber AS SequenceNumber
	|FROM
	|	InformationRegister.SharedUsers AS SharedUsers
	|WHERE
	|	SharedUsers.IBUserID = &IBUserID";
	
	SetPrivilegedMode(True);
	Selection = Query.Execute().Select();
	SetPrivilegedMode(False);
	If Selection.Next() Then
		Return Selection.SequenceNumber;
	Else
		Return "";
	EndIf;
	
EndFunction

#EndRegion

#EndIf
